tonykai/Gateway-Big-Board-/STM32F401-Discovery_FW_V1.0.0/Projects/Peripheral_Examples/GPIO_IOToggle/main.c
/*===================================Library==================================*/
#include "stm32f401_discovery.h"
#include "stm32f4xx.h"
#include "stdio.h"
#include "math.h"
#include "defines.h"

#include "tm_stm32f4_usart.h"
#include "tm_stm32f4_adc.h"
#include "tm_stm32f4_usb_vcp.h"
#include "misc.h"
#include "ff.h"
#include "diskio.h"
#include "SPI_MSD0_Driver.h"
/*=============================================================================*/

/*====================================Define===================================*/
#define NULL 0
#define BUFLN  128	/* must be a power of 2, see ltsamp() */
#define EYECLS 0.25
#define MaxQRSw 0.13
#define Rawdata_N 128

FATFS fs;           
FRESULT res;                 
DIR dirs;
FIL file;
FILINFO finfo;
UINT br;
unsigned char buffer[2000];
char spfline[30];
unsigned int ECGData;
unsigned int TempData;
unsigned int GsensorX;
unsigned int GsensorY;
unsigned int GsensorZ;
const int gain = 200;
const int sps = 128;
const int PWFreq = 60;
int LPn = 2;				//(int)sps/PWFreq;
int LP2n =4;				//(int)2*sps/PWFreq;
double lfsc = 390.625;	//(double)1.25*gain*gain/sps;
int LTwindow = 16;			//(int)sps*MaxQRSw;
int ebuf[BUFLN]={0};
int lbuf[BUFLN]={0};
int HR_count=0;
int HR_Value=60;
int ECG_Rawdata[Rawdata_N]={0};
unsigned int ADC_Value[5]={0,0,0,0,0};
int count_t;
static long int LT_count=0;
int QRS_result;
int TempCount=0;

unsigned char Gdata_X_H,Gdata_X_L;
unsigned char Gdata_Y_H,Gdata_Y_L;
unsigned char Gdata_Z_H,Gdata_Z_L;

unsigned int G_data_All_X;
unsigned int G_data_All_Y;
unsigned int G_data_All_Z;

static void TIM_Config(uint16_t period,uint16_t prec);
static void Delay(__IO uint32_t nCount);
int qrs_detect(long int t_count,int *inputdata);
int ltsamp(long int t,int *inputdata);
int getsample(long int tt,int *inputdata);

void Gsensor_Write(unsigned char REG_Address,unsigned char REG_data);
/*==============================================================================*/



/*=================================GsensorDefine================================*/
#define	SlaveAddress 	0x32
#define WHO_AM_I		0x0F
#define CTRL_REG1		0x20
#define CTRL_REG2		0x21
#define CTRL_REG3		0x22
#define CTRL_REG4		0x23
#define CTRL_REG5		0x24
#define CTRL_REG1_Data  0X2F

#define REFERENCE		0x26
#define STATUS_REG		0x27
#define OUT_X_ALL		0x28
#define OUT_X_L			0x28
#define OUT_X_H			0x29
#define OUT_Y_ALL		0x2A
#define OUT_Y_L			0x2A
#define OUT_Y_H			0x2B
#define OUT_Z_ALL		0x2C
#define OUT_Z_L			0x2C
#define OUT_Z_H			0x2D

#define INT1_CFG		0x30
#define INT1_SOURCE		0x31
#define INT1_THS		0x32
#define INT1_DURATION	0x33
#define INT2_CFG		0x34
#define INT2_SOURCE		0x35
#define INT2_THS		0x36
#define INT2_DURATION	0x37
/*==============================================================================*/

/*===================================SendData===================================*/
void BT_Send_ECG(void){
	unsigned char ECGLow;
	unsigned char ECGHigh;
	
	ECGData=TM_ADC_Read(ADC1,ADC_Channel_3);
	ECGLow = ECGData&0x00ff;
	ECGHigh = (ECGData>>8)&0x00ff;
	
	TM_USART_Putc(USART2, ECGLow);
	TM_USART_Putc(USART2, ECGHigh);
}
void BT_Send_Temp(void){
	unsigned char TempLow;
	unsigned char TempHigh;
	
	TempData=TM_ADC_Read(ADC1,ADC_Channel_12);
	TempLow = TempData&0x00ff;
	TempHigh = (TempData>>8)&0x00ff;
	
	TM_USART_Putc(USART2, TempLow);  
	TM_USART_Putc(USART2, TempHigh);
}
/*==============================================================================*/


/*===================================I2C(I2C1)==================================*/
void I2C_GPIO_Init(void){
	//初始化GPIO的pin腳
	GPIO_InitTypeDef GPIO_InitStruct;
	I2C_InitTypeDef I2C_InitStruct;
	
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

	
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_OD;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP; 
	
	GPIO_Init(GPIOB, &GPIO_InitStruct);
	
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_I2C1);   //PB6:SCL
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_I2C1);   //PB7:SDA
	
	I2C_InitStruct.I2C_Mode=I2C_Mode_SMBusHost;
	I2C_InitStruct.I2C_DutyCycle=I2C_DutyCycle_2;
	I2C_InitStruct.I2C_OwnAddress1 = 0X00;
	I2C_InitStruct.I2C_Ack=I2C_Ack_Enable;
	I2C_InitStruct.I2C_AcknowledgedAddress=I2C_AcknowledgedAddress_7bit;
	I2C_InitStruct.I2C_ClockSpeed=300000;
	I2C_Init(I2C1, &I2C_InitStruct);
	
	I2C_Cmd(I2C1,ENABLE);
}
void I2C_start(I2C_TypeDef* I2Cx, uint8_t address, uint8_t direction){
		
		/*
			發送設備地址+R/W bit
			
			Parameter:
			I2Cx-->使用的I2C
			address-->7 bits address
			direction-->transmitter/receiver
			
		*/
			// 等待I2C1不忙的時候
//    while(I2C_GetFlagStatus(I2Cx, I2C_FLAG_BUSY));
		
 
    //對I2C1發送啟動信號
    I2C_GenerateSTART(I2Cx, ENABLE);
 
    // 等待I2C1從設備確認啟動信號
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT));
 
    // Send slave Address for write 
    I2C_Send7bitAddress(I2Cx, address, direction);
		
		//I2C_Direction_Tranmitter:主發送模式
		//I2C_Direction_Tranmitter:主接收模式
		if(direction == I2C_Direction_Transmitter){
        while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED));
    } else if(direction == I2C_Direction_Receiver){
        while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED));
    }
}
void I2C_write(I2C_TypeDef* I2Cx, uint8_t data){
	
		/*
			發送1byte到SlaveDevice
			
			Parameter:
			I2Cx-->使用的I2C
			data-->要發送的資料
			
		*/
		
    I2C_SendData(I2Cx, data);
    // 等待I2C1發送一個byte
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED));
}
uint8_t I2C_read_ack(I2C_TypeDef* I2Cx){
		
		/*
			從SlaveDevice讀取一個byte並請求後面一個byte
			
			Parameter:
			I2Cx-->使用的I2C
			
		*/
	
		uint8_t data;
    // 啟用並確認設定接收資料
    I2C_AcknowledgeConfig(I2Cx, ENABLE);
    // 等待接收到一個byte
    while( !I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED) );
    // 從I2C暫存器讀取一個byte並回傳
    data = I2C_ReceiveData(I2Cx);
    return data;
}
uint8_t I2C_read_nack(I2C_TypeDef* I2Cx){
		
