tonykai/Gateway-Big-Board-/STM32F401-Discovery_FW_V1.0.0/Projects/Peripheral_Examples/GPIO_IOToggle/main.c
		/*
			從SlaveDevice讀取一個byte但不請求後面一個byte
			
			Parameter:
			I2Cx-->使用的I2C
			
		*/
	
		uint8_t data;
    // disabe acknowledge of received data
    // nack also generates stop condition after last byte received
    // see reference manual for more info
    I2C_AcknowledgeConfig(I2Cx, DISABLE);
    I2C_GenerateSTOP(I2Cx, ENABLE);
    // 等待接收到一個byte
    while( !I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_RECEIVED) );
    // 從I2C暫存器讀取一個byte並回傳
    data = I2C_ReceiveData(I2Cx);
    return data;
}
void I2C_stop(I2C_TypeDef* I2Cx){
    
		/*
			發送停止訊號並釋放I2C匯流排
			
			Parameter:
			I2Cx-->使用的I2C
			
		*/
	
		// 停止I2C1
    I2C_GenerateSTOP(I2Cx, ENABLE);
}
void writeReg(int reg, int value){
    
		/*
			將值寫入暫存器內
			
			Parameter:
			reg-->暫存器地址
			value-->要寫入暫存器的值
	
		*/
	
		I2C_start(I2C1, SlaveAddress, I2C_Direction_Transmitter); // 在transmitter模式下準備開始發送
    I2C_write(I2C1, reg); // 指定要寫入的暫存器
    I2C_write(I2C1, value); // 寫入暫存器的值
    I2C_stop(I2C1); // 停止發送
}
int readReg(int reg){
    
		/*
			讀取暫存器
			
			Parameter:
			reg-->暫存器地址
			
		*/
	
		int value;
    
    I2C_start(I2C1, SlaveAddress, I2C_Direction_Transmitter); // 在transmitter模式下準備開始發送
    I2C_write(I2C1, reg); // 指定要寫入的暫存器  
    I2C_stop(I2C1); // 寫入暫存器的值
       
    I2C_start(I2C1, SlaveAddress, I2C_Direction_Transmitter); // 在transmitter模式下準備開始發送
    value = I2C_read_ack(I2C1); // 從LIS331DLH讀取一個byte後並請求後面一個byte
    I2C_read_nack(I2C1); // 讀取一個byte後就不在讀取下一個byte(停止傳輸)
    
    return value;
}
void Gsensor_Init(void){
	I2C_GPIO_Init(); //先初始化I2C的GPIO
	writeReg(CTRL_REG1, 0x2F); //在REG1中寫入0x2F(00101111)，開啟REG1(詳細請看LIS331DLH datasheet)
}
void Gsensor_readValue(){
		I2C_start(I2C1, SlaveAddress, I2C_Direction_Transmitter); // 在transmitter模式下準備開始發送
    I2C_write(I2C1, 0x28 | (1 << 7)); // 從0x28開始讀取三軸加速規的high值以及low值共六個值，多留一個值避免少傳
    I2C_stop(I2C1); // 停止發送
    
    I2C_start(I2C1, SlaveAddress, I2C_Direction_Receiver); // 在receiver模式下準備接收
    
    Gdata_X_L = I2C_read_ack(I2C1); // 讀取0x28，x軸的Low byte，並要求下一個byte
    Gdata_X_H = I2C_read_ack(I2C1); // 讀取0x29，x軸的High byte，並要求下一個byte
    Gdata_Y_L = I2C_read_ack(I2C1); // 讀取0x2A，y軸的Low byte，並要求下一個byte
    Gdata_Y_H = I2C_read_ack(I2C1); // 讀取0x2B，y軸的High byte，並要求下一個byte
    Gdata_Z_L = I2C_read_ack(I2C1); // 讀取0x2C，z軸的Low byte，並要求下一個byte
    Gdata_Z_H = I2C_read_ack(I2C1); // 讀取0x2D，z軸的High byte，並要求下一個byte
        
    I2C_read_nack(I2C1); // 讀取0x2E，當初保留的預設值，但不要求下一個byte
	
		//把high byte跟low byte加起來
		G_data_All_X=(short)((Gdata_X_H<<8)+Gdata_X_L);
		G_data_All_Y=(short)((Gdata_Y_H<<8)+Gdata_Y_L);
		G_data_All_Z=(short)((Gdata_Z_H<<8)+Gdata_Z_L);
}
/*==============================================================================*/

/*===============================BlueTooth(USART2)==============================*/
void BT_GPIO_Init(void){
	GPIO_InitTypeDef  GPIO_InitStructure;
	
  // GPIOD Periph clock enable 
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

  // Configure PD12, PD13, PD14 and PD15 in output pushpull mode 
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 ;   //Pin0: Power   Pin1:RST   Pin2:Pairing   Pin3:SW_BTN   Pin4:Status
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;   //setting out 
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOD, &GPIO_InitStructure);   //Initial GPIO
}
void BT_RST(int st){
 if(st==1)
	 GPIO_SetBits(GPIOD,GPIO_Pin_1);
 else
	 GPIO_ResetBits(GPIOD,GPIO_Pin_1);
}
void BT_Power(int st){
 if(st==1)
	 GPIO_SetBits(GPIOD,GPIO_Pin_0);
 else
	 GPIO_ResetBits(GPIOD,GPIO_Pin_0);
}
void BT_Pairing(int st){
 if(st==1)
	 GPIO_SetBits(GPIOD,GPIO_Pin_2);
 else
	 GPIO_ResetBits(GPIOD,GPIO_Pin_2);
}

void BT_BTN(int st){
 if(st==1)
	 GPIO_SetBits(GPIOD,GPIO_Pin_3);
 else
	 GPIO_ResetBits(GPIOD,GPIO_Pin_3);
}

void BT_Status(int st){
 if(st==1)
	 GPIO_SetBits(GPIOD,GPIO_Pin_4);
 else
	 GPIO_ResetBits(GPIOD,GPIO_Pin_4);
}

void BT_USART_Init(void){
	GPIO_InitTypeDef  GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	
	//啟用USART2的RCC時鐘
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2 , ENABLE);
	
	//啟用GPIOD的RCC時鐘
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD , ENABLE);
	
	//將PD5和PD6連接至USART2
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource5,GPIO_AF_USART2);
	GPIO_PinAFConfig(GPIOD,GPIO_PinSource6,GPIO_AF_USART2);
	
	//設定PD5給Tx用
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	//GPIO_PinAFConfig(GPIOD,GPIO_PinSource1,GPIO_AF_USART1);
	
	//設定PD6給Rx用
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	//USART基本參數設定
	USART_InitStructure.USART_BaudRate = 115200;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits=USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	
	USART_Init(USART2,&USART_InitStructure);
	
	//USART啟用
	USART_Cmd(USART2,ENABLE);
	
	//USART_Puts(USART1, "Init complete!Hello World");
}
void BT_Start(void){
	BT_GPIO_Init();     //Initial GPIO
	
	BT_Power(0);        //Give Power 'Low' as open，0 as low
	Delay(1000);        //Don't start component simutaneously
	BT_BTN(1);          //Give SE_BTN 'High' as open，1 as high 
	Delay(500);
	BT_RST(1);          //Give RST 'High' as open，1 as high 
	Delay(1000);
	BT_Pairing(0);      //Give Pairing 'Low' as close，0 as low
	Delay(1000);
	BT_Pairing(1);      //Give Pairing 'High' as open，1 as high
	
	BT_USART_Init();    //Initial USART
}

