tonykai/Gateway-Big-Board-/STM32F401-Discovery_FW_V1.0.0/Projects/Peripheral_Examples/GPIO_IOToggle/main.c
int fputc(int ch, FILE *f) {
    /* Do your stuff here */
    /* Send your custom byte */
    /* Send byte to USART */
    TM_USART_Putc(USART2, ch);
    
    /* If everything is OK, you have to return character written */
    return ch;
    /* If character is not correct, you can return EOF (-1) to stop writing */
    return -1;
}
/*==============================================================================*/

/* We need to implement own __FILE struct */
/* FILE struct is used from __FILE */
/* You need this if you want use printf */
/* Struct FILE is implemented in stdio.h */
//FILE __stdout;



/*===============================SDCard Function==================================*/
int Status;
char buff_d[512]={0};

struct __FILE {
    int dummy;
};
void SDCard_Write(void){
	MSD0_SPI_Configuration();
	Status=MSD0_Init();
		
	res=f_mount(0, &fs);
	//Open file.If file exists ,opened;file doesn't exists ,create new file 
	res = f_open(&file, "0:/RawData.txt",FA_OPEN_ALWAYS|FA_READ|FA_WRITE );
	if(res!=FR_OK) { printf("f_open() fail \r\n"); }
	else { printf("f_open() success \r\n"); }
	 
	//Write file
	res = f_lseek(&file, file.fsize);   
	br = f_puts("1234567890", &file) ;  //Write "1234567890" into string
	if(br<1) { printf("f_puts() fail \r\n"); }
	else
 { 
 printf("f_puts() success \r\n");
 }
	
	res = f_lseek(&file, 2);   
	br = f_puts("--", &file) ;  //Write "--" into string
	if(br<1) { printf("f_puts() fail \r\n"); }
	else { printf("f_puts() success \r\n"); }
	
	//Read file
	br = file.fsize;
	printf("file size:%d\r\n",br);
	res = f_read(&file, buffer, file.fsize, &br);     //Read a char repeatly until end of file
	if(res == FR_OK ) { printf("text:%s\r\n", buffer); }
	else { printf(" f_read() fail \r\n"); }

	//close file
	f_close(&file);
}



/*================================================================================*/



/*===============================Temperature Function=================================*/
void Temp_Init(void){
		GPIO_InitTypeDef GPIO_InitStructure;
	
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
    GPIO_Init(GPIOC, &GPIO_InitStructure); 
	
		GPIO_SetBits(GPIOC,GPIO_Pin_2);
}
/*================================================================================*/



/*===============================ECG_ADC Function=================================*/
void ECG_ADC_U9_Init(void){ 
    GPIO_InitTypeDef GPIO_InitStructure; 

		/* 啟用C4_SDN的 RCC 時鐘 */
		RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE); //使用C4_SDN腳位輸出
    
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
		GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
    GPIO_Init(GPIOC, &GPIO_InitStructure); 
	
		GPIO_SetBits(GPIOC,GPIO_Pin_7);
} 

/*================================================================================*/



/*=================================QRS_Detection==================================*/
int qrs_detect(long int t_count,int *inputdata){
	static int jump_state=0;
	static int jump_count=0;
	static int L_state=0;
//	static int LT_data=0;
	static long int T0=0;
	static int T1=0;
	static int Ta=0;
//	static int T1,Ta;
	static int LT_data=0;

	switch(L_state){
		case 0:
		{
			T0 +=ltsamp(t_count,inputdata);
			//360Hz-1440 128Hz-512
			if(t_count >= (512-1) ) {
				L_state=1;
				T0 = (long int)(T0/512);
				T1=(int)2*T0;
				Ta=3*T0;
			}
			break;
		}
		case 1:
		{
			LT_data=ltsamp(t_count,inputdata);
			if(LT_data>T1) {
				Ta +=(LT_data-Ta)/10;
				T1=Ta/3;
			}
			//360Hz-2880 128Hz-1024
			if(t_count>=(1024-1)){
			L_state=2;
			}
			break;
		}
		case 2:
		{
			LT_data=ltsamp(t_count,inputdata);
			if(jump_state==0){
				if(LT_data>T1) {
//					tqrs=t_count-4;	//360Hz-12 128Hz-4
					jump_state=1;
					jump_count=0;
					return 1;
				}
			}
			else {
				jump_count++;
				//360Hz-80 128Hz-40
				if(jump_count>=40) {
				jump_count=0;
				jump_state=0;
				}
				if(LT_data>T1) {
					Ta +=(LT_data-Ta)/10;
					T1=Ta/3;
				}
			}
			break;
		}
		default: L_state=0;break;
		}
	return 0;
}


int ltsamp(long int t,int *inputdata){
	int dy;
	static long int tt = -1;
	static int Yn, Yn1, Yn2;
	static int buf_state=0;

//	if (lbuf == NULL)
//	{
//		lbuf = (int *)malloc((unsigned)BUFLN * sizeof(int));
//		ebuf = (int *)malloc((unsigned)BUFLN * sizeof(int));
		if (buf_state==0)
		{
			for (ebuf[0] = (int)sqrt(lfsc), tt = 1L; tt < BUFLN; tt++)
				ebuf[tt] = ebuf[0];
			if (t > BUFLN) tt = (t - BUFLN);
			else tt = -1;
			Yn = Yn1 = Yn2 = 0;
			buf_state=1;
		}
//		else memory_error();
//
//		if(t<tt-BUFLN) memory_error();
//	}

	while (t > tt) 
	{
		int v0=0,v1=0,v2=0;
		static int aet = 0,et;

		Yn2 = Yn1;
		Yn1 = Yn;
		v0 = getsample(tt,inputdata);
		v1 = getsample(tt-LPn,inputdata);
		v2 = getsample(tt-LP2n,inputdata);
//		Yn = getsample(tt);by tg
//		Yn1 = getsample(tt-1);by tg
		Yn = 2*Yn1 - Yn2 + v0 - 2*v1 + v2;
		dy = (Yn - Yn1) / LP2n;		/* lowpass derivative of input */
//		dy = (Yn - Yn1);		/* lowpass derivative of input */ by tg
		et = ebuf[(++tt)&(BUFLN-1)] = (int)sqrt(lfsc +dy*dy); /* length transform */
		lbuf[(tt)&(BUFLN-1)] = aet += et - ebuf[(tt-LTwindow)&(BUFLN-1)];
	}
	return lbuf[t&(BUFLN-1)];
}
int getsample(long int tt,int *inputdata){
	if(tt<0)
		tt=0;
	return inputdata[tt&(Rawdata_N-1)];
//	return input_testdata[tt&(INBUF)];//????
}
/*================================================================================*/

 int main(void){	
	TM_USB_VCP_Init(); //USB VCP Initialize
	BT_Start(); //Enable BlueTooth(USART2)
	Gsensor_Init(); //Enable Gsensor(I2C)
	ECG_ADC_U9_Init(); //Enable ECG Module U9
	TM_ADC_Init(ADC1,ADC_Channel_3); //Enable ADC1_Channel_3,ECG
	TM_ADC_Init(ADC1,ADC_Channel_12); //Enable ADC1_Channel_12,Temperature
	TIM_Config(525 - 1 , 1250 - 1); //128Hz,Clock=84MHz, (84000000/period)/prescaler=Freq
	
	while(1){
		
