tonykai/Gateway-Big-Board-/STM32F401-Discovery_FW_V1.0.0/Projects/Peripheral_Examples/GPIO_IOToggle/main.c
	}
	
}



/*===================================Interrupt==================================*/
//Timer Setting
void TIM_Config(uint16_t period,uint16_t prec){
  NVIC_InitTypeDef NVIC_InitStructure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	
  // TIM3 clock enable 
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);

  // Enable the TIM3 gloabal Interrupt 
  NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;   //中斷時執行的函式
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; //優先順序
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1; //次優先順序
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	
	TIM_TimeBaseStructure.TIM_Period = period;     //自動重裝值

  TIM_TimeBaseStructure.TIM_Prescaler = prec;    //Timer分頻
 
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up; //向上計數模式
	
	TIM_TimeBaseStructure.TIM_RepetitionCounter = 0;
	
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure); //初始化Timer
	
	TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE); //允許更新中斷
   
  TIM_Cmd(TIM3, ENABLE); //Enable Timer
}
//定時器3中斷函式
void TIM3_IRQHandler(){
	unsigned char ECGLow;
	unsigned char ECGHigh;
	unsigned char TempLow;
	unsigned char TempHigh;
	unsigned char GsensorXLow;
	unsigned char GsensorXHigh;
	unsigned char GsensorYLow;
	unsigned char GsensorYHigh;
	unsigned char GsensorZLow;
	unsigned char GsensorZHigh;
	
	
	if(TIM_GetITStatus(TIM3 , TIM_IT_Update) == SET) //確認是否有執行中斷
	{
		if(I2C_GetFlagStatus(I2C1, I2C_FLAG_BUSY))
		{
			TM_USART_Putc(USART2,0x00);
			TM_USART_Putc(USART2,0x00);
			
			if(TM_USB_VCP_GetStatus()==TM_USB_VCP_CONNECTED){
				TM_USB_VCP_Putc(0xA5);	//Header
				TM_USB_VCP_Putc(0xA5);	//Header
				TM_USB_VCP_Putc(0x00);	//Gsensor_X,Low,Graph1
				TM_USB_VCP_Putc(0x00);	//Gsensor_X,High,Graph1
				TM_USB_VCP_Putc(0x00);	//ECG,Low,Graph2
				TM_USB_VCP_Putc(0x00);	//ECG,High,Graph2
				TM_USB_VCP_Putc(0x00);	//Gsensor_Y,Low,Graph3
				TM_USB_VCP_Putc(0x00);	//Gsensor_Y,High,Graph3
				TM_USB_VCP_Putc(0x00);	//Gsensor_Z,Low,Graph4
				TM_USB_VCP_Putc(0x00);	//Gsensor_Z,High,Graph4
				TM_USB_VCP_Putc(0x00);	//Temprature,Low
				TM_USB_VCP_Putc(0x00);	//Temprature,High
				TM_USB_VCP_Putc(0x00);	//Reddot on ECG
				TM_USB_VCP_Putc(0x00);	//Reddot on ECG
			}
		}
		else
		{
			Gsensor_readValue();
			ECGData = TM_ADC_Read(ADC1,ADC_Channel_3); //設定Data的值為ADC1的Channel3轉換出來的值
			if(TempCount==0)
			{
				TempData = TM_ADC_Read(ADC1,ADC_Channel_12);
				TempCount = 128;
			}
			
			
			//調整三軸加速規的值到程式可以顯示的範圍
			GsensorX = ((G_data_All_X)+32768)>>4;
			GsensorY = ((G_data_All_Y)+32768)>>4;
			GsensorZ = ((G_data_All_Z)+32768)>>4;
			
			ECGLow = ECGData&0x00ff;   //Low值取Data的低8bits
			ECGHigh = (ECGData>>8)&0x00ff; //High值先將Data Shift 8bits後再取值，不過因為ADC取12bits且低8bits已經使用過，所以High值只有12-8=4bits
			TempLow = TempData&0x00ff;
			TempHigh = (TempData>>8)&0x00ff;
			GsensorXLow = GsensorX&0x00ff;
			GsensorXHigh = (GsensorX>>8)&0x00ff;
			GsensorYLow = GsensorY&0x00ff;
			GsensorYHigh = (GsensorY>>8)&0x00ff;
			GsensorZLow = GsensorZ&0x00ff;
			GsensorZHigh = (GsensorZ>>8)&0x00ff;
			
			ECG_Rawdata[LT_count&(Rawdata_N-1)]=ECGData-2048;
			QRS_result=qrs_detect(LT_count,ECG_Rawdata);
			
			if(QRS_result>0) {
				HR_Value=(int)(7680.0/HR_count);//60*128/HR_count +0.5 for int convert
				HR_count=0;
			}
			else {
				HR_count++;
			}
			
			//透過藍芽傳送心電訊號
			TM_USART_Putc(USART2,ECGLow);
			TM_USART_Putc(USART2,ECGHigh);
			
			//if USB is connected,send out all data via USB
			if(TM_USB_VCP_GetStatus()==TM_USB_VCP_CONNECTED){
				TM_USB_VCP_Putc(0xA5);	//Header
				TM_USB_VCP_Putc(0xA5);	//Header
				TM_USB_VCP_Putc(GsensorXLow);	//Gsensor_X,Low,Graph1
				TM_USB_VCP_Putc(GsensorXHigh);	//Gsensor_X,High,Graph1
				TM_USB_VCP_Putc((ECG_Rawdata[(LT_count)&(Rawdata_N-1)]+2048)&0xFF);	//ECG,Low,Graph2
				TM_USB_VCP_Putc(((ECG_Rawdata[(LT_count)&(Rawdata_N-1)]+2048)>>8)&0xFF);	//ECG,High,Graph2
				TM_USB_VCP_Putc(GsensorYLow);	//Gsensor_Y,Low,Graph3
				TM_USB_VCP_Putc(GsensorYHigh);	//Gsensor_Y,High,Graph3
				TM_USB_VCP_Putc(GsensorZLow);	//Gsensor_Z,Low,Graph4
				TM_USB_VCP_Putc(GsensorZHigh);	//Gsensor_Z,High,Graph4
				TM_USB_VCP_Putc(TempLow);	//Temprature,Low
				TM_USB_VCP_Putc(TempHigh);	//Temprature,High
				TM_USB_VCP_Putc((unsigned char)QRS_result);	//Reddot on ECG
				TM_USB_VCP_Putc((unsigned char)HR_Value);	//Reddot on ECG
			}
			
			count_t++;
			LT_count++;
			TempCount--;
		}
		
		TIM_ClearITPendingBit(TIM3 , TIM_FLAG_Update);  //清除中斷的標示
	}
}
/*==============================================================================*/

void Delay(__IO uint32_t nCount){
  while(nCount--)
  {
  }
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
static void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
